output/posts/finding-debuginfo-loss/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Finding DebugInfo Loss | gramanas &gt;&gt; blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" id="css_theme" href="../../assets/css/theme.gray.css" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://gramanas.github.io/posts/finding-debuginfo-loss/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Anastasis Grammenos">
<meta property="og:site_name" content="gramanas &gt;&gt; blog">
<meta property="og:title" content="Finding DebugInfo Loss">
<meta property="og:url" content="https://gramanas.github.io/posts/finding-debuginfo-loss/">
<meta property="og:description" content="In order to fix DebugInfo loss I need to find where and when it occurs.
Many transformations result in DI loss due to the simple fact that they change
and optimize code and thus the resulting llvm IR ">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-03-27T15:51:52+03:00">
</head>
<body>
    

    <header id="header" class="header transparent"><div class="container">
            <div class="scroll top">
                <a href="#"><i class="icon-chevron-up icon-large"></i></a>
            </div>

            
    <div class="brand">
        <div class="flip_container">
            <div class="flipper">
                <div class="front">
                    <p><a href="https://gramanas.github.io/" title="gramanas &gt;&gt; blog" rel="home">

                        <span id="blog-title">gramanas &gt;&gt; blog</span>
                    </a></p>
                </div>

                <div class="back">
                    <p><a href="https://gramanas.github.io/" title="LLVM development log for GSoC 2018" rel="home">
                        <span id="blog-description">LLVM development log for GSoC 2018</span>
                    </a></p>
                </div>			
            </div>
        </div>
    </div>

            
    <nav id="menu" role="navigation"><ul>
<li><a href="../../archive.html">Archive</a></li>
                <li><a href="../../rss.xml">RSS feed</a></li>
    
    
    </ul></nav>
</div>
        <div class="separator clearfix"></div>
    </header><div class="body">
        <div id="main" class="container">
            
    <div class="post">
    
    <h1 class="p-name entry-title" itemprop="headline name">Finding DebugInfo Loss</h1>

        <div class="meta clearfix">
            <div class="authordate left">
                <time class="timeago" datetime="2018-03-27T15:51:52+03:00">2018/03/27</time>
            

            
          |  
        <a href="index.org" id="sourcelink">Source</a>

            </div>
            

    <div itemprop="keywords" class="tags right">
        <span class="tags">
            <span class="muted small"> <i class="icon-tag"></i> </span>
        </span>
    </div>

        </div>
        <p>
In order to fix <code>DebugInfo</code> loss I need to find where and when it occurs.
Many transformations result in <code>DI</code> loss due to the simple fact that they change
and optimize code and thus the resulting llvm IR doesn't match the
original code.
</p>

<p>
The opt tool has the <code>-debugify</code> and <code>-check-debugify</code> flags to attach
<code>DI</code> to everything and then check if it's correct.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Find culprit transformations</h2>
<div class="outline-text-2" id="text-1">
<p>
With a simple bash script I can run tests under a transformation folder
like so:
</p>

<div class="highlight"><pre><span></span><span class="k">for</span> i in <span class="k">$(</span>ls ~/code/llvm/test/Transforms/<span class="nv">$TRANSFORMATION</span>/*.ll -1<span class="k">)</span><span class="p">;</span> <span class="k">do</span> 
    <span class="nb">echo</span> -e <span class="nv">$i</span><span class="s2">":\n-------"</span><span class="p">;</span> 
    opt -debugify -<span class="nv">$TRANSFORMATION</span> -check-debugify -disable-output <span class="nv">$i</span><span class="p">;</span>
    <span class="nb">echo</span> -e <span class="s2">"-------\n"</span><span class="p">;</span> 
<span class="k">done</span> &gt; results <span class="m">2</span>&gt;<span class="p">&amp;</span><span class="m">1</span>
</pre></div>

<p>
and then proceed to view the results.
</p>

<p>
For example here is the command for the LICM transformation:
</p>

<div class="highlight"><pre><span></span><span class="k">for</span> i in <span class="k">$(</span>ls ~/code/llvm/test/Transforms/LICM/*.ll -1<span class="k">)</span><span class="p">;</span> <span class="k">do</span> 
    <span class="nb">echo</span> -e <span class="nv">$i</span><span class="s2">":\n-------"</span><span class="p">;</span> 
    opt -debugify -licm -check-debugify -disable-output <span class="nv">$i</span><span class="p">;</span> 
    <span class="nb">echo</span> -e <span class="s2">"-------\n"</span><span class="p">;</span> 
<span class="k">done</span> &gt; results <span class="m">2</span>&gt;<span class="p">&amp;</span><span class="m">1</span>
</pre></div>

<p>
Here is a sample of the <code>results</code> file:
</p>

<div class="highlight"><pre><span></span>/home/gramanas/code/llvm/test/Transforms/LICM/2003-02-27-StoreSinkPHIs.ll:
-------
CheckDebugify: PASS
-------

/home/gramanas/code/llvm/test/Transforms/LICM/2003-05-02-LoadHoist.ll:
-------
ERROR: Instruction with empty DebugLoc --   %B.lcssa <span class="o">=</span> phi i32 <span class="o">[</span> %B, %Loop <span class="o">]</span>
CheckDebugify: FAIL
-------

/home/gramanas/code/llvm/test/Transforms/LICM/2004-09-14-AliasAnalysisInvalidate.ll:
-------
WARNING: Missing line <span class="m">3</span>
WARNING: Missing line <span class="m">4</span>
CheckDebugify: PASS
-------

/home/gramanas/code/llvm/test/Transforms/LICM/2003-02-28-PromoteDifferentType.ll:
-------
ERROR: Instruction with empty DebugLoc --   %P2 <span class="o">=</span> bitcast i32* %P to i8*
WARNING: Missing line <span class="m">3</span>
CheckDebugify: FAIL
-------
</pre></div>
</div>
</div>
        
        <ul class="pager hidden-print">
<li class="previous">
                <a href="../debug-information/" rel="prev" title="Debug Information">Previous post</a>
            </li>
            <li class="next">
                <a href="../community-bonding/" rel="next" title="Community Bonding">Next post</a>
            </li>
        </ul>
</div>



        </div>
    </div>
    

    <footer class="footer"><div class="container clearfix">
            <div class="social pull-left">
                <ul>
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<a href="../../rss.xml" target="_blank">
                        <li> <i class="icon-rss icon-large"></i> 
                        </li>
                    </a>
                </ul>
</div>
            <div class="copyright pull-right">
                <p>Contents © 2018         <a href="mailto:anastasis.gramm2@gmail.com">Anastasis Grammenos</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
                
            </div>
            
        </div>
    </footer><script src="../../assets/js/all-nocdn.js" type="text/javascript"></script>
</body>
</html>
